In [3]:
import pandas as pd
data={
    'Country':['France','Spain','Germany','Spain','Germany','France','Spain','France','Germany','France'],
    'Age':[44,27,30,38,40,35,None,48,50,37],
    'Salary':[72000,48000,54000,61000,None,58000,52000,79000,83000,67000],
    'Purchased':[0,1,0,0,1,1,0,1,0,1]
}
df=pd.DataFrame(data)
print(df)

   Country   Age   Salary  Purchased
0   France  44.0  72000.0          0
1    Spain  27.0  48000.0          1
2  Germany  30.0  54000.0          0
3    Spain  38.0  61000.0          0
4  Germany  40.0      NaN          1
5   France  35.0  58000.0          1
6    Spain   NaN  52000.0          0
7   France  48.0  79000.0          1
8  Germany  50.0  83000.0          0
9   France  37.0  67000.0          1

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     int64
dtypes: float64(2), int64(1), object(1)
memory usage: 448.0+ bytes

In [6]:
independent_variables = df[['Country','Age','Purchased']]
print("Independent Variables:")
print(independent_variables.head())

Independent Variables:
   Country   Age  Purchased
0   France  44.0          0
1    Spain  27.0          1
2  Germany  30.0          0
3    Spain  38.0          0
4  Germany  40.0          1

In [7]:
dependent_variable = df['Salary']
print("Dependent Variable:")
print(dependent_variable.head())

Dependent Variable:
0    72000.0
1    48000.0
2    54000.0
3    61000.0
4        NaN
Name: Salary, dtype: float64

In [12]:
import numpy as np
df.replace(0,np.nan,inplace=True)
mean_values=df.mean()
df.fillna(mean_values,inplace=True)
print(df)

   Country        Age        Salary  Purchased
0   France  44.000000  72000.000000        1.0
1    Spain  27.000000  48000.000000        1.0
2  Germany  30.000000  54000.000000        1.0
3    Spain  38.000000  61000.000000        1.0
4  Germany  40.000000  63777.777778        1.0
5   France  35.000000  58000.000000        1.0
6    Spain  38.777778  52000.000000        1.0
7   France  48.000000  79000.000000        1.0
8  Germany  50.000000  83000.000000        1.0
9   France  37.000000  67000.000000        1.0

C:\Users\22i270\AppData\Local\Temp\ipykernel_17624\694942305.py:3: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  mean_values=df.mean()

In [17]:
data={
    'Country':['France','Spain','Germany','Spain','Germany','France','Spain','France','Germany','France'],
    'Age':[44,27,30,38,40,35,None,48,50,37],
    'Salary':[72000,48000,54000,61000,None,58000,52000,79000,83000,67000],
    'Purchased':[0,1,0,0,1,1,0,1,0,1]
}
df=pd.DataFrame(data)
one_hot=pd.get_dummies(df)
print(one_hot)

    Age   Salary  Purchased  Country_France  Country_Germany  Country_Spain
0  44.0  72000.0          0               1                0              0
1  27.0  48000.0          1               0                0              1
2  30.0  54000.0          0               0                1              0
3  38.0  61000.0          0               0                0              1
4  40.0      NaN          1               0                1              0
5  35.0  58000.0          1               1                0              0
6   NaN  52000.0          0               0                0              1
7  48.0  79000.0          1               1                0              0
8  50.0  83000.0          0               0                1              0
9  37.0  67000.0          1               1                0              0

In [31]:
data={
    'Country':['France','Spain','Germany','Spain','Germany','France','Spain','France','Germany','France'],
    'Age':[44,27,30,38,40,35,None,48,50,37],
    'Salary':[72000,48000,54000,61000,None,58000,52000,79000,83000,67000],
    'Purchased':[0,1,0,0,1,1,0,1,0,1]
}
from sklearn.preprocessing import LabelEncoder
df = pd.DataFrame(data)
encoder = LabelEncoder()
df['Salary_encoded'] = encoder.fit_transform(df['Salary'])
print(df)

   Country   Age   Salary  Purchased  Salary_encoded
0   France  44.0  72000.0          0               6
1    Spain  27.0  48000.0          1               0
2  Germany  30.0  54000.0          0               2
3    Spain  38.0  61000.0          0               4
4  Germany  40.0      NaN          1               9
5   France  35.0  58000.0          1               3
6    Spain   NaN  52000.0          0               1
7   France  48.0  79000.0          1               7
8  Germany  50.0  83000.0          0               8
9   France  37.0  67000.0          1               5

In [27]:
from sklearn.model_selection import train_test_split
data={
    'Country':['France','Spain','Germany','Spain','Germany','France','Spain','France','Germany','France'],
    'Age':[44,27,30,38,40,35,None,48,50,37],
    'Salary':[72000,48000,54000,61000,None,58000,52000,79000,83000,67000],
    'Purchased':[0,1,0,0,1,1,0,1,0,1]
}
df = pd.DataFrame(data)
x = df[['Country','Age','Purchased']]
y = df['Salary']
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3, random_state=42)
print("x_train shape:", x_train.shape)
print("x_test shape:", x_test.shape)
print("y_train shape:", y_train.shape)
print("y_test shape:", y_test.shape)
print("\nTraining Features:")
print(x_train)
print("\nTesting Features:")
print(x_test)
print("\nTraining Target:")
print(y_train)
print("\nTesting Target:")
print(y_test)

x_train shape: (7, 3)
x_test shape: (3, 3)
y_train shape: (7,)
y_test shape: (3,)

Training Features:
   Country   Age  Purchased
0   France  44.0          0
7   France  48.0          1
2  Germany  30.0          0
9   France  37.0          1
4  Germany  40.0          1
3    Spain  38.0          0
6    Spain   NaN          0

Testing Features:
   Country   Age  Purchased
8  Germany  50.0          0
1    Spain  27.0          1
5   France  35.0          1

Training Target:
0    72000.0
7    79000.0
2    54000.0
9    67000.0
4        NaN
3    61000.0
6    52000.0
Name: Salary, dtype: float64

Testing Target:
8    83000.0
1    48000.0
5    58000.0
Name: Salary, dtype: float64

DataFrame after min-max normalization:
   Country   Age   Salary  Purchased  Salary_encoded  Age_normalized  \
0   France  44.0  72000.0          0               6        0.685714
1    Spain  27.0  48000.0          1               0        0.000000
2  Germany  30.0  54000.0          0               2        0.171429
3    Spain  38.0  61000.0          0               4        0.371429
4  Germany  40.0      NaN          1               9             NaN
5   France  35.0  58000.0          1               3        0.285714
6    Spain   NaN  52000.0          0               1        0.114286
7   France  48.0  79000.0          1               7        0.885714
8  Germany  50.0  83000.0          0               8        1.000000
9   France  37.0  67000.0          1               5        0.542857

   Salary_normalized
0           0.685714
1           0.000000
2           0.171429
3           0.371429
4                NaN
5           0.285714
6           0.114286
7           0.885714
8           1.000000
9           0.542857

In [40]:
data={
    'Country':['France','Spain','Germany','Spain','Germany','France','Spain','France','Germany','France'],
    'Age':[44,27,30,38,40,35,None,48,50,37],
    'Salary':[72000,48000,54000,61000,None,58000,52000,79000,83000,67000],
    'Purchased':[0,1,0,0,1,1,0,1,0,1]
}
df = pd.DataFrame(data)
z_scale=df.copy()
for column in z_scale.columns[2:]:
    z_scale[column]=(z_scale[column]-z_scale[column].mean())/z_scale[column].std()
display(z_scale)

   Country   Age    Salary  Purchased
0   France  44.0  0.670349  -0.948683
1    Spain  27.0 -1.286346   0.948683
2  Germany  30.0 -0.797172  -0.948683
3    Spain  38.0 -0.226469  -0.948683
4  Germany  40.0       NaN   0.948683
5   France  35.0 -0.471056   0.948683
6    Spain   NaN -0.960230  -0.948683
7   France  48.0  1.241052   0.948683
8  Germany  50.0  1.567168  -0.948683
9   France  37.0  0.262704   0.948683

In [38]:
data={
    'Country':['France','Spain','Germany','Spain','Germany','France','Spain','France','Germany','France'],
    'Age':[44,27,30,38,40,35,None,48,50,37],
    'Salary':[72000,48000,54000,61000,None,58000,52000,79000,83000,67000],
    'Purchased':[0,1,0,0,1,1,0,1,0,1]
}
df = pd.DataFrame(data)
column_to_normalize = 'Salary'
column_min = df[column_to_normalize].min()
column_max = df[column_to_normalize].max()
df['Salary_normalized'] = (df[column_to_normalize] - column_min) / (column_max - column_min)
print("DataFrame after min-max normalization:")
print(df)

DataFrame after min-max normalization:
   Country   Age   Salary  Purchased  Salary_normalized
0   France  44.0  72000.0          0           0.685714
1    Spain  27.0  48000.0          1           0.000000
2  Germany  30.0  54000.0          0           0.171429
3    Spain  38.0  61000.0          0           0.371429
4  Germany  40.0      NaN          1                NaN
5   France  35.0  58000.0          1           0.285714
6    Spain   NaN  52000.0          0           0.114286
7   France  48.0  79000.0          1           0.885714
8  Germany  50.0  83000.0          0           1.000000
9   France  37.0  67000.0          1           0.542857